[{"questionId":1,"content":"Donec dapibus. Duis at velit eu est congue elementum.","upVotes":1,"downVotes":1,"createdAt":"5/3/2025","updatedAt":"5/26/2025","isAnonymous":false,"userId":1,"courseId":1, "viewCount": 9},
{"questionId":2,"content":"Curabitur convallis. Duis consequat dui nec nisi volutpat eleifend. Donec ut dolor. Morbi vel lectus in quam fringilla rhoncus. Mauris enim leo, rhoncus sed, vestibulum sit amet, cursus id, turpis. Integer aliquet, massa id lobortis convallis, tortor risus dapibus augue, vel accumsan tellus nisi eu orci.","upVotes":2,"downVotes":2,"createdAt":"12/24/2024","updatedAt":"10/27/2024","isAnonymous":true,"userId":2,"courseId":2,"viewCount":5},
{"questionId":3,"content":"Nulla nisl. Nunc nisl. Duis bibendum, felis sed interdum venenatis, turpis enim blandit mi, in porttitor pede justo eu massa.","upVotes":3,"downVotes":3,"createdAt":"10/21/2024","updatedAt":"3/24/2025","isAnonymous":true,"userId":3,"courseId":3,"viewCount":5},
{"questionId":4,"content":"Cras in purus eu magna vulputate luctus. Cum sociis natoque penatibus et magnis dis parturient montes, nascetur ridiculus mus.","upVotes":4,"downVotes":4,"createdAt":"7/19/2025","updatedAt":"7/18/2025","isAnonymous":true,"userId":4,"courseId":4,"viewCount":5},
{"questionId":5,"content":"Pellentesque ultrices mattis odio. Donec vitae nisi. Nam ultrices, libero non mattis pulvinar, nulla pede ullamcorper augue, a suscipit nulla elit ac nulla. Sed vel enim sit amet nunc viverra dapibus. Nulla suscipit ligula in lacus. Curabitur at ipsum ac tellus semper interdum.","upVotes":5,"downVotes":5,"createdAt":"3/24/2025","updatedAt":"12/13/2024","isAnonymous":false,"userId":5,"courseId":5,"viewCount":5},
{"questionId":6,"content":"Nam congue, risus semper porta volutpat, quam pede lobortis ligula, sit amet eleifend pede libero quis orci. Nullam molestie nibh in lectus. Pellentesque at nulla. Suspendisse potenti. Cras in purus eu magna vulputate luctus.","upVotes":6,"downVotes":6,"createdAt":"8/19/2025","updatedAt":"6/24/2025","isAnonymous":false,"userId":6,"courseId":6,"viewCount":5},
{"questionId":7,"content":"Etiam vel augue. Vestibulum rutrum rutrum neque. Aenean auctor gravida sem. Praesent id massa id nisl venenatis lacinia.","upVotes":7,"downVotes":7,"createdAt":"12/24/2024","updatedAt":"10/31/2024","isAnonymous":false,"userId":7,"courseId":7,"viewCount":5},
{"questionId":8,"content":"Morbi sem mauris, laoreet ut, rhoncus aliquet, pulvinar sed, nisl. Nunc rhoncus dui vel sem.","upVotes":8,"downVotes":8,"createdAt":"3/17/2025","updatedAt":"10/12/2024","isAnonymous":false,"userId":8,"courseId":8,"viewCount":5},
{"questionId":9,"content":"Vestibulum ante ipsum primis in faucibus orci luctus et ultrices posuere cubilia Curae; Duis faucibus accumsan odio. Curabitur convallis. Duis consequat dui nec nisi volutpat eleifend. Donec ut dolor. Morbi vel lectus in quam fringilla rhoncus. Mauris enim leo, rhoncus sed, vestibulum sit amet, cursus id, turpis. Integer aliquet, massa id lobortis convallis, tortor risus dapibus augue, vel accumsan tellus nisi eu orci. Mauris lacinia sapien quis libero. Nullam sit amet turpis elementum ligula vehicula consequat. Morbi a ipsum.","upVotes":9,"downVotes":9,"createdAt":"5/28/2025","updatedAt":"10/23/2024","isAnonymous":false,"userId":9,"courseId":9,"viewcCunt":59},
{"questionId":10,"content":"Maecenas tristique, est et tempus semper, est quam pharetra magna, ac consequat metus sapien ut nunc.","upVotes":10,"downVotes":10,"createdAt":"9/27/2025","updatedAt":"12/5/2024","isAnonymous":false,"userId":10,"courseId":10, "viewCount":7}]